{"id":"jogl_2002_beach_structure","title":"Crystal structure of the BEACH domain reveals an unusual fold and extensive association with a novel PH domain","authors":"Jogl G, Shen Y, Gebauer D, Li J, Wiegmann K, Kashkar H, Krönke M, Tong L","journal":"EMBO J","year":"2002","doi":"10.1093/emboj/cdf502","url":"https://pmc.ncbi.nlm.nih.gov/articles/PMC126298/","keyAssumptions":"BEACH domains function as scaffolding elements; PH and BEACH domains are separate functional units","keyHypotheses":"PH-BEACH domains form integrated structural unit with functional groove for ligand binding","strengths":"First high-resolution structure; reveals unusual fold; demonstrates extensive domain-domain interface","weaknesses":"Static structure only; no dynamic information; assumes rigid domain coupling","citation":"Jogl G, et al. EMBO J. 2002;21(18):4785-4795","notes":"Foundational structural study establishing PH-BEACH as functional unit, but assumes static interaction. Supports our coupling hypothesis structurally but lacks dynamic perspective.","addedDate":"2025-08-16T02:01:15.000Z"}
{"id":"pereira_gershlick_2024_review","title":"BEACH domain proteins in membrane trafficking and disease","authors":"Pereira C, Gershlick DC","journal":"J Cell Biol","year":"2024","doi":"10.1083/jcb.202410147","url":"https://pmc.ncbi.nlm.nih.gov/articles/PMC11554752/","keyAssumptions":"BEACH proteins primarily function in vesicle trafficking; disease mechanisms involve simple loss of function","keyHypotheses":"BEACH proteins are multi-pathway regulators with complex disease mechanisms involving network disruption","strengths":"Comprehensive recent review; integrates multiple functional studies; identifies research gaps","weaknesses":"Review format limits mechanistic depth; some speculation on regulatory mechanisms","citation":"Pereira C, Gershlick DC. J Cell Biol. 2024;223(12):e202410147","notes":"Strong support for dynamic regulation hypothesis. Demonstrates multi-pathway coordination consistent with allosteric networks rather than static scaffolding.","addedDate":"2025-08-16T02:01:16.000Z"}
{"id":"szentgyorgyi_2024_lrba_trafficking","title":"Arf1-dependent LRBA recruitment to Rab4 endosomes is required for endolysosome homeostasis","authors":"Szentgyörgyi V, Lueck LM, Overwijn D, Ritz D, Zoeller N, Patino-Lopez G, Shaw PJ, Warnatz K, Grimbacher B, Frauenknecht K, Rethwilm M, Rohr KB, Rolink AG, Hennet T, Spang A","journal":"J Cell Biol","year":"2024","doi":"10.1083/jcb.202401167","url":"https://pmc.ncbi.nlm.nih.gov/articles/PMC11449124/","keyAssumptions":"BEACH proteins constitutively associate with membranes; function independent of GTPase regulation","keyHypotheses":"LRBA recruitment is dynamically regulated by Arf1 activation state, enabling context-dependent function","strengths":"Direct demonstration of regulated recruitment; quantitative trafficking assays; functional validation","weaknesses":"Mechanistic details of Arf1-LRBA interaction unclear; limited structural insight","citation":"Szentgyörgyi V, et al. J Cell Biol. 2024;223(11):e202401167","notes":"Provides strong evidence for dynamic regulation over static scaffolding. Demonstrates conformational responsiveness to cellular GTPase states, supporting allosteric regulation hypothesis.","addedDate":"2025-08-16T02:01:17.000Z"}
{"id":"repetto_2018_neurobeachin_domains","title":"Molecular Dissection of Neurobeachin Function at Excitatory Synapses","authors":"Repetto D, Brockhaus J, Rhee HJ, Lee C, Kilimann MW, Rhee J, Northoff LM, Guo W, Reissner C, Missler M","journal":"Front Synaptic Neurosci","year":"2018","doi":"10.3389/fnsyn.2018.00028","url":"https://www.frontiersin.org/journals/synaptic-neuroscience/articles/10.3389/fnsyn.2018.00028/full","keyAssumptions":"All domains contribute equally to function; domains work independently; full-length protein required for all functions","keyHypotheses":"PH-BEACH complex is sufficient minimal functional unit; different domains provide specific regulatory inputs","strengths":"Systematic domain dissection; multiple functional readouts; quantitative rescue experiments","weaknesses":"Limited mechanistic insight into domain communication; focus on single protein family","citation":"Repetto D, et al. Front Synaptic Neurosci. 2018;10:28","notes":"Demonstrates PH-BEACH as integrated functional unit with regulatory cross-talk between domains. Strong support for allosteric network model where different domains provide regulatory inputs.","addedDate":"2025-08-16T02:01:18.000Z"}
{"id":"roy_2016_ph_allosteric","title":"Allosteric properties of PH domains in Arf regulatory proteins","authors":"Roy NS, Yohe ME, Randazzo PA, Gruschus JM","journal":"Cell Logist","year":"2016","doi":"10.1080/21592799.2016.1181700","url":"https://pmc.ncbi.nlm.nih.gov/articles/PMC4878581/","keyAssumptions":"PH domains primarily function as membrane-binding modules; limited regulatory communication with other domains","keyHypotheses":"PH domains function as allosteric regulators with context-dependent binding and conformational networks","strengths":"Multiple biophysical approaches; demonstrates conformational networks; functional validation","weaknesses":"Limited to Arf regulatory proteins; PH-BEACH coupling not directly studied","citation":"Roy NS, et al. Cell Logist. 2016;6(2):e1181700","notes":"Provides mechanistic framework for PH-BEACH allosteric coupling by establishing PH domains as allosteric elements capable of transmitting conformational changes.","addedDate":"2025-08-16T02:01:19.000Z"}